app/helpers/sessions_helper.rb

  def current_user
    # if user_id equals session id
    if (user_id = session[:user_id])
      @current_user ||= User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]