app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "d"], ["user_id", 101], ["created_at", "2021-04-21 01:04:11.950423"], ["updated_at", "2021-04-21 01:04:11.950423"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    @micropost.image.attach(params[:micropost][:image])
    if @micropost.save

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 101], ["id", 306], ["LIMIT", 1]]
---
  def correct_user
    @micropost = current_user.microposts.find_by(id: params[:id])